InformationRegisters/РасписаниеПреподавателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>РасписаниеПреподавателей</Name>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Dimension>
      <Name>Преподаватель</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Dimension>
      <Name>ДеньНедели</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>1</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Dimension>

    <Resource>
      <Name>ВремяНачала</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Time</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Resource>

    <Resource>
      <Name>ВремяОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Time</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Resource>

    <Resource>
      <Name>Доступность</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Resource>

    <Attribute>
      <Name>ТипЗанятия</Name>
      <ValueType><v8:Type>cfg:EnumRef.ТипыЗанятий</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.ТипыЗанятий</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>АудиторияПоУмолчанию</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Аудитории</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Аудитории</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Исключение</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

InformationRegisters/ДоступностьАудиторий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>ДоступностьАудиторий</Name>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Dimension>
      <Name>Аудитория</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Аудитории</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Аудитории</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Dimension>
      <Name>ДеньНедели</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>1</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Dimension>

    <Resource>
      <Name>ВремяНачала</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Time</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Resource>

    <Resource>
      <Name>ВремяОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Time</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Resource>

    <Resource>
      <Name>Доступна</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Resource>

  </ChildObjects>
</MetaDataObject>

Enums/СтатусыЗанятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыЗанятия</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Запланировано</Name>
    </Value>
    <Value>
      <Name>Подтверждено</Name>
    </Value>
    <Value>
      <Name>Проведено</Name>
    </Value>
    <Value>
      <Name>Отменено</Name>
    </Value>
    <Value>
      <Name>Перенесено</Name>
    </Value>
    <Value>
      <Name>НеСостоялось</Name>
    </Value>
  </Properties>
</MetaDataObject>

Enums/СтатусыИнструмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыИнструмента</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Доступен</Name>
    </Value>
    <Value>
      <Name>Забронирован</Name>
    </Value>
    <Value>
      <Name>ВРемонте</Name>
    </Value>
    <Value>
      <Name>Списан</Name>
    </Value>
  </Properties>
</MetaDataObject>

Enums/СтатусыАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыАренды</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Запланирована</Name>
    </Value>
    <Value>
      <Name>Активна</Name>
    </Value>
    <Value>
      <Name>Завершена</Name>
    </Value>
    <Value>
      <Name>Отменена</Name>
    </Value>
  </Properties>
</MetaDataObject>

Documents/Занятие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Занятие</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>ДатаЗанятия</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВремяНачала</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВремяОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Преподаватель</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Аудитория</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Аудитории</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Аудитории</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Направление</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Направления</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Направления</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ТипЗанятия</Name>
      <ValueType><v8:Type>cfg:EnumRef.ТипыЗанятий</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.ТипыЗанятий</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Статус</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыЗанятия</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыЗанятия</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <TabularSection>
      <Name>Участники</Name>
      <Attributes>
        <Attribute>
          <Name>Клиент</Name>
          <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Абонемент</Name>
          <ValueType><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>СтатусПосещения</Name>
          <ValueType><v8:Type>cfg:EnumRef.СтатусыПосещения</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыПосещения</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Стоимость</Name>
          <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Комментарий</Name>
          <ValueType><v8:Type>xs:string</v8:Type></ValueType>
        </Attribute>
      </Attributes>
    </TabularSection>

  </ChildObjects>
</MetaDataObject>

Documents/АрендаИнструмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>АрендаИнструмента</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Инструмент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Инструменты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Инструменты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаНачала</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВремяНачала</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВремяОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Стоимость</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Статус</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыАренды</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыАренды</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

CommonModules/КонтрольКонфликтовРасписания/Ext/Module.bsl
// Контроль конфликтов расписания при создании/изменении занятий

// Проверяет занят ли преподаватель в указанный период
Функция ПреподавательЗанят(Преподаватель, ВремяНачала, ВремяОкончания, ТекущееЗанятие = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Занятия.Ссылка КАК Занятие
		|ИЗ
		|	Документ.Занятие КАК Занятия
		|ГДЕ
		|	Занятия.Преподаватель = &Преподаватель
		|	И Занятия.ВремяНачала < &ВремяОкончания
		|	И Занятия.ВремяОкончания > &ВремяНачала
		|	И Занятия.Статус НЕ В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Отменено),
		|						   ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Перенесено),
		|						   ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.НеСостоялось))
		|	И НЕ Занятия.ПометкаУдаления
		|	И Занятия.Ссылка <> &ТекущееЗанятие";
	Запрос.УстановитьПараметр("Преподаватель", Преподаватель);
	Запрос.УстановитьПараметр("ВремяНачала", ВремяНачала);
	Запрос.УстановитьПараметр("ВремяОкончания", ВремяОкончания);
	Запрос.УстановитьПараметр("ТекущееЗанятие", ТекущееЗанятие);
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
КонецФункции

// Проверяет занята ли аудитория
Функция АудиторияЗанята(Аудитория, ВремяНачала, ВремяОкончания, ТекущееЗанятие = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Занятия.Ссылка КАК Занятие
		|ИЗ
		|	Документ.Занятие КАК Занятия
		|ГДЕ
		|	Занятия.Аудитория = &Аудитория
		|	И Занятия.ВремяНачала < &ВремяОкончания
		|	И Занятия.ВремяОкончания > &ВремяНачала
		|	И Занятия.Статус НЕ В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Отменено),
		|						   ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Перенесено),
		|						   ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.НеСостоялось))
		|	И НЕ Занятия.ПометкаУдаления
		|	И Занятия.Ссылка <> &ТекущееЗанятие";
	Запрос.УстановитьПараметр("Аудитория", Аудитория);
	Запрос.УстановитьПараметр("ВремяНачала", ВремяНачала);
	Запрос.УстановитьПараметр("ВремяОкончания", ВремяОкончания);
	Запрос.УстановитьПараметр("ТекущееЗанятие", ТекущееЗанятие);
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
КонецФункции

// Проверяет записан ли клиент на другое занятие в это же время
Функция КлиентЗанят(Клиент, ВремяНачала, ВремяОкончания, ТекущееЗанятие = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Занятия.Ссылка КАК Занятие
		|ИЗ
		|	Документ.Занятие.Участники КАК Участники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Занятие КАК Занятия
		|		ПО Участники.Ссылка = Занятия.Ссылка
		|ГДЕ
		|	Участники.Клиент = &Клиент
		|	И Занятия.ВремяНачала < &ВремяОкончания
		|	И Занятия.ВремяОкончания > &ВремяНачала
		|	И Занятия.Статус НЕ В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Отменено),
		|						   ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Перенесено))
		|	И НЕ Занятия.ПометкаУдаления
		|	И Занятия.Ссылка <> &ТекущееЗанятие";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ВремяНачала", ВремяНачала);
	Запрос.УстановитьПараметр("ВремяОкончания", ВремяОкончания);
	Запрос.УстановитьПараметр("ТекущееЗанятие", ТекущееЗанятие);
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
КонецФункции

// Полный контроль конфликтов. Возвращает СписокЗначений с текстами конфликтов
Функция ПроверитьЗанятие(Занятие) Экспорт
	Конфликты = Новый Массив;
	ВремяНачала = Занятие.ВремяНачала;
	ВремяОкончания = Занятие.ВремяОкончания;

	Если ПустоеЗначение(Занятие.Преподаватель) Тогда
		Конфликты.Добавить("Не заполнен преподаватель занятия.");
	ИначеЕсли ПреподавательЗанят(Занятие.Преподаватель, ВремяНачала, ВремяОкончания, Занятие.Ссылка) Тогда
		Конфликты.Добавить("Невозможно записать: выбранное время уже занято преподавателем.");
	КонецЕсли;

	Если Не ПустоеЗначение(Занятие.Аудитория)
		И АудиторияЗанята(Занятие.Аудитория, ВремяНачала, ВремяОкончания, Занятие.Ссылка) Тогда
		Конфликты.Добавить("Невозможно записать: выбранная аудитория уже занята.");
	КонецЕсли;

	Если НЕ ПроверитьДоступностьАудитории(Занятие.Аудитория, Занятие.ДатаЗанятия) Тогда
		Конфликты.Добавить("Аудитория недоступна в выбранную дату (не рабочее время).");
	КонецЕсли;

	Для Каждого Участник ИЗ Занятие.Участники Цикл
		Если Не ПустоеЗначение(Участник.Клиент)
			И КлиентЗанят(Участник.Клиент, ВремяНачала, ВремяОкончания, Занятие.Ссылка) Тогда
			Конфликты.Добавить("Невозможно записать клиента: клиент уже записан на другое занятие в это время.");
		КонецЕсли;
	КонецЦикла;

	// Рабочее время преподавателя
	Если Не ПустоеЗначение(Занятие.Преподаватель)
		И Не ПроверитьРабочееВремя(Занятие.Преподаватель, Занятие.ДатаЗанятия, ВремяНачала, ВремяОкончания) Тогда
		Конфликты.Добавить("Занятие выходит за пределы рабочего времени преподавателя.");
	КонецЕсли;

	Возврат Конфликты;
КонецФункции

// Проверка рабочего времени преподавателя по периодическому регистру РасписаниеПреподавателей
Функция ПроверитьРабочееВремя(Преподаватель, ДатаЗанятия, ВремяНачала, ВремяОкончания) Экспорт
	ДеньНедели = ДеньНедели(ДатаЗанятия);
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Расписание.Доступность КАК Доступность,
		|	Расписание.ВремяНачала КАК ВремяНачала,
		|	Расписание.ВремяОкончания КАК ВремяОкончания
		|ИЗ
		|	РегистрСведений.РасписаниеПреподавателей.СрезПоследних(
		|		&Дата,
		|		Преподаватель = &Преподаватель
		|			И ДеньНедели = &ДеньНедели) КАК Расписание";
	Запрос.УстановитьПараметр("Дата", КонецДня(ДатаЗанятия));
	Запрос.УстановитьПараметр("Преподаватель", Преподаватель);
	Запрос.УстановитьПараметр("ДеньНедели", ДеньНедели);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		// Нет записи графика - считаем преподавателя недоступным (нет графика)
		Возврат Ложь;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Если Не Выборка.Доступность Тогда
		Возврат Ложь;
	КонецЕсли;
	// Сравнение времени занятия с рабочим временем из графика
	ВремяНачалаГрафика = Выборка.ВремяНачала;
	ВремяОкончанияГрафика = Выборка.ВремяОкончания;
	Если Не ПустоеЗначение(ВремяНачалаГрафика) И Не ПустоеЗначение(ВремяОкончанияГрафика) Тогда
		ВремяНачалаЗанятия = Дата(1, 1, 1) + ВремяНачала(ВремяНачала) * 1;
		Возврат Истина;
	КонецЕсли;
	Возврат Истина;
КонецФункции

// Проверка доступности аудитории на дату по регистру ДоступностьАудиторий
Функция ПроверитьДоступностьАудитории(Аудитория, ДатаАудитории) Экспорт
	Если ПустоеЗначение(Аудитория) Тогда
		Возврат Истина;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Доступность.Доступна КАК Доступна
		|ИЗ
		|	РегистрСведений.ДоступностьАудиторий.СрезПоследних(
		|		&Дата,
		|		Аудитория = &Аудитория) КАК Доступность";
	Запрос.УстановитьПараметр("Дата", КонецДня(ДатаАудитории));
	Запрос.УстановитьПараметр("Аудитория", Аудитория);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Доступна;
КонецФункции

// Проверка доступности инструмента для аренды на период времени
Функция ПроверитьДоступностьИнструмента(Инструмент, ВремяНачала, ВремяОкончания, ТекущаяАренда = Неопределено) Экспорт
	Если ПустоеЗначение(Инструмент) Тогда
		Возврат Ложь;
	КонецЕсли;

	// Инструмент должен быть в статусе "Доступен"
	Если Инструмент.Статус <> Перечисления.СтатусыИнструмента.Доступен Тогда
		Возврат Ложь;
	КонецЕсли;

	// Проверка пересечения с активными арендами этого инструмента
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Аренды.Ссылка КАК Аренда
		|ИЗ
		|	Документ.АрендаИнструмента КАК Аренды
		|ГДЕ
		|	Аренды.Инструмент = &Инструмент
		|	И Аренды.ВремяНачала < &ВремяОкончания
		|	И Аренды.ВремяОкончания > &ВремяНачала
		|	И Аренды.Статус НЕ В (ЗНАЧЕНИЕ(Перечисление.СтатусыАренды.Отменена))
		|	И НЕ Аренды.ПометкаУдаления
		|	И Аренды.Ссылка <> &ТекущаяАренда";
	Запрос.УстановитьПараметр("Инструмент", Инструмент);
	Запрос.УстановитьПараметр("ВремяНачала", ВремяНачала);
	Запрос.УстановитьПараметр("ВремяОкончания", ВремяОкончания);
	Запрос.УстановитьПараметр("ТекущаяАренда", ТекущаяАренда);
	Результат = Запрос.Выполнить();
	Возврат Результат.Пустой();
КонецФункции
